// зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
//     1. перебрати його циклом while

let arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
// let i=0;
// while (i<arr.length){
//     console.log(arr[i]);
//     i++;
// }


// 2. перебрати його циклом for

// for (let j = 0; j < arr.length; j++) {
//     console.log(arr[j]);
//
// }

// 3. перебрати циклом while та вивести  числа тільки з непарним індексом

// let k = 0;
// while (k < arr.length)
// {
//    if (k % 2 !== 0)
//    {
//     console.log(arr[k]);
//
//     }
//     k++;
// }


// 4. перебрати циклом for та вивести  числа тільки з непарним індексом

// for (let i = 0; i < arr.length; i++) {
//     if (i % 2 !== 0) {
//         console.log(arr[i]);
//     }
//
// }


// 5. перебрати циклом while та вивести  числа тільки парні  значення


// let g = 0;
// while (g < arr.length) {
//     if (arr[g] % 2 === 0) {
//         console.log(arr[g]);
//
//     }
//     g++;
// }


// 6. перебрати циклом for та вивести  числа тільки парні  значення


// for (let i = 0; i < arr.length; i++) {
//     if (arr[i] % 2 === 0) {
//         console.log(arr[i]);
//         document.write(`${i}`);
//     }
// }

// 7. замінити кожне число кратне 3 на слово "okten"


// for (let i = 0; i < arr.length; i++) {
//     if (arr[i] % 3 === 0) {
//         arr[i]='Okten';
//         console.log(arr[i]);
//     }else {
//         console.log(arr[i])
//     }
//
// }

// 8. вивести масив в зворотньому порядку.


// for (let j = arr.length-1; j >=0 ; j--) {
//     console.log(arr[j]);
// }


// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)

// --------------1 перебрати його циклом while зворотній напрямок

// let i = arr.length - 1;
// while (i >= 0)
// {
//     console.log(arr[i]);
//     i--;
// }

// -----------2 перебрати його циклом for зворотній напрямок

// for (let j = arr.length-1; j >=0 ; j--) {
//     console.log(arr[j]);
//
// }

// ---------3 перебрати циклом while та вивести  числа тільки з непарним індексом зворотній напрямок

// let k = arr.length - 1;
// while (k  >= 0)
// {
//    if (k % 2 !== 0)
//    {
//     console.log(arr[k]);
//
//     }
//     k--;
// }


//----------------4 перебрати циклом for та вивести  числа тільки з непарним індексом зворотній напрямок


// for (let i = arr.length-1; i >=0 ; i--) {
//     if (i % 2 !== 0) {
//         console.log(arr[i]);
//         document.write(`${i}`);
//     }
//
// }


//-----------5 перебрати циклом while та вивести  числа тільки парні  значення зворотній напрямок


// let g = arr.length-1;
// while (g >=0 ) {
//     if (arr[g] % 2 === 0) {
//         console.log(arr[g]);
//         document.write(`${g}`);
//
//     }
//     g--;
// }


//----------6 перебрати циклом for та вивести  числа тільки парні  значення зворотній напрямок


//
// for (let i = arr.length-1; i >=0 ; i--) {
//     if (arr[i] % 2 === 0) {
//         console.log(arr[i]);
//         document.write(`${i}`);
//     }
//
// }



//-------------------7. замінити кожне число кратне 3 на слово "okten" зворотній напрямок


// for (let i = arr.length-1; i >=0 ; i--) {
//     if (arr[i] % 3 === 0) {
//         arr[i]='Okten';
//         console.log(arr[i]);
//     }else {
//         console.log(arr[i])
//     }
//
// }















