// 1- Користувач вводить або має два числа.
//     Потрібно знайти та вивести максимальне число з тих двох .
//     Також потрібно врахувати коли введені рівні числа.



// - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

let q = 'first entrance';
let w = 'second entrance';
let e = 'third entrance';
let r = prompt('apartment number');
if (r >= 1 && r <= 20) {
    console.log(q);
} else if (r >= 21 && r <= 48) {
    console.log(w);
} else if (r >= 49 && r <= 90) {
    console.log(e);
}else {
    console.log('сусідній будинок');
}

// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО,
//     якщо змінна не рівна 10 - тоді НЕВІРНО

let number = prompt('числове значення');
if (number === '10') {
    alert('ВІРНО');
} else {
    console.log('НЕВІРНО');
}


// - Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
// якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else


let x = true;
if (typeof x === 'number' ) {
    console.log(1);
} else if (typeof x === 'string'){
    console.log(2);
}else if (typeof x === 'boolean'){
    console.log(3);
}else if (typeof x === 'object'){
    console.log(4);
}else {
    console.log(0);
}



// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН


let temp = prompt('temperature');
if (temp >=10 && temp <= 22) {
    document.write(`ми йдемо ВЧИТИСЯ`);
}else {
    document.write(`сидимо вдома і вчимося ОНЛАЙН`);
}


// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
    // числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .



let play = prompt('enter nubber');
switch (play) {
    case '1':
        alert('ВИ виграли автомобіль');
        break;
    case '2':
        alert('Ви виграли телефон');
        break;
    case '3':
        alert('Квиток');
        break;
    case '4':
        alert('Книжка');
        break;
    case '5':
        alert('Квартира');
        break;
    default:
        alert('число не вірне');

}




















